---
kind: other
id: Properties.T:Autodesk.Revit.DB.ParameterValuePresenceRule
source: html/5b1038f2-48c1-c28c-bcbc-c25836b1418d.htm
---
# ParameterValuePresenceRule Properties

Specifies whether the .NET object represents a valid Revit entity.